import pytest
from dotenv import dotenv_values

from business.exceptions.exceptions import NotAVacancyException
from details.parser.deepseek.deepseek_vacansies_parser import DeepSeekVacanciesParser


@pytest.mark.slow
class TestVacationParser:
    def test_parse_one(self):
        token = dotenv_values("back/secrets/.env")['DEEPSEEK_TOKEN']
        parser = DeepSeekVacanciesParser(token)
        vacancy_text = (
            "#вакансия #python #удаленка #backend #middle\n"
            "💼 Middle / Middle+ Python/Django разработчик (B2C, проект Valta)\n\n"
            "О компании и проекте:\n"
            "Valta Pet Products — e-commerce компания, развивающая B2C-направление для брендов в сфере зоотоваров. "
            "Сейчас команда полностью переписывает платформу на Django, выстраивая архитектуру заново с акцентом на стабильность, "
            "масштабируемость и высокую производительность.\n\n"
            "Стек и требования:\n"
            "Python, Django - отличное знание фреймворка, понимание его устройства\n"
            "Django Ninja или FastAPI - опыт работы на практическом уровне\n"
            "Celery - опыт работы на практическом уровне\n"
            "PostgreSQL - на уровне оптимизации запросов\n"
            "Redis, RabbitMQ - опыт работы на практическом уровне\n"
            "JWT - авторизация/аутентификация (must have)\n"
            "Docker - будет плюсом\n"
            "Важно: понимание принципов SOLID и уверенное владение ООП.\n\n"
            "Условия:\n"
            "Вилка: 200 000 – 240 000 ₽ (по результатам собеседования)\n"
            "Формат: полная удалёнка, не приближенка\n"
            "Гибкий график, важно быть на связи с 10:00 до 13:00 мск\n"
            "Приоритет на результат, а не на процессы\n\n"
            "📩 Контакты для откликов: @asyasukhanovarecr"
        )
        vacancy = {'text': vacancy_text}
        parsed_vacancy = parser.parse_one(vacancy)
        assert parsed_vacancy['languages'] == ['python']
        assert parsed_vacancy['salary'] == {'min': 200000, 'max': 240000}
        assert parsed_vacancy['work_mode'] == 'remote'

    def test_dont_parse_not_programmer_vacancy(self):
        token = dotenv_values("back/secrets/.env")['DEEPSEEK_TOKEN']
        parser = DeepSeekVacanciesParser(token)
        vacancy = {'text':"Ваканасия баристы в известную кофейню"}
        with pytest.raises(NotAVacancyException):
            parser.parse_one(vacancy)

    def test_generate_cover_latter(self):
        token = dotenv_values("back/secrets/.env")['DEEPSEEK_TOKEN']
        parser = DeepSeekVacanciesParser(token)
        vacancy = {'text': "#вакансия #python #удаленка #backend #middle\n💼 Middle / Middle+ Python/Django разработчик (B2C, проект Valta)\n\nО компании и проекте:\nValta Pet Products — e-commerce компания, развивающая B2C-направление для брендов в сфере зоотоваров. Сейчас команда полностью переписывает платформу на Django, выстраивая архитектуру заново с акцентом на стабильность, масштабируемость и высокую производительность.\n\nСтек и требования:\nPython, Django - отличное знание фреймворка, понимание его устройства\nDjango Ninja или FastAPI - опыт работы на практическом уровне\nCelery - опыт работы на практическом уровне\nPostgreSQL - на уровне оптимизации запросов\nRedis, RabbitMQ - опыт работы на практическом уровне\nJWT - авторизация/аутентификация (must have)\nDocker - будет плюсом\nВажно: понимание принципов SOLID и уверенное владение ООП.\n\nУсловия:\nВилка: 200 000 – 240 000 ₽ (по результатам собеседования)\nФормат: полная удалёнка, не приближенка\nГибкий график, важно быть на связи с 10:00 до 13:00 мск\nПриоритет на результат, а не на процессы\n\n📩 Контакты для откликов: @asyasukhanovarecr"}
        resume = "Резюме программиста. Опыт 5 лет Python, Django, Flask, Fastapi."

        cover_latter = parser.generate_cover_latter(vacancy, resume)

        print(cover_latter)
        assert cover_latter != None
