from types import SimpleNamespace as sn

from vacancy.parser.deepseek.deepseek_vacansies_parser import DeepSeekVacanciesParser


class TestVacationParser:
    def test_convert(self):
        parser = DeepSeekVacanciesParser()

        vacancy_text_1 = (
            "#вакансия #python #удаленка #backend #middle\n"
            "💼 Middle / Middle+ Python/Django разработчик (B2C, проект Valta)\n\n"
            "О компании и проекте:\n"
            "Valta Pet Products — e-commerce компания, развивающая B2C-направление для брендов в сфере зоотоваров. "
            "Сейчас команда полностью переписывает платформу на Django, выстраивая архитектуру заново с акцентом на стабильность, "
            "масштабируемость и высокую производительность.\n\n"
            "Стек и требования:\n"
            "Python, Django - отличное знание фреймворка, понимание его устройства\n"
            "Django Ninja или FastAPI - опыт работы на практическом уровне\n"
            "Celery - опыт работы на практическом уровне\n"
            "PostgreSQL - на уровне оптимизации запросов\n"
            "Redis, RabbitMQ - опыт работы на практическом уровне\n"
            "JWT - авторизация/аутентификация (must have)\n"
            "Docker - будет плюсом\n"
            "Важно: понимание принципов SOLID и уверенное владение ООП.\n\n"
            "Условия:\n"
            "Вилка: 200 000 – 240 000 ₽ (по результатам собеседования)\n"
            "Формат: полная удалёнка, не приближенка\n"
            "Гибкий график, важно быть на связи с 10:00 до 13:00 мск\n"
            "Приоритет на результат, а не на процессы\n\n"
            "📩 Контакты для откликов: @asyasukhanovarecr"
        )

        vacancy_text_2 = (
            "#вакансия #удаленка #Python #ETL #Pandas #Airflow #fulltime #Senior #РФ #vacancy #remote\n\n"
            "Позиция: Senior разработчик (Python) с уклоном знаний ETL/ELT/DWH\n"
            "Проект: Участие в разработке крупной информационной системы\n"
            "Локация: удаленка по РФ, только из РФ, работа по МСК.\n"
            "Уровень: senior. От 4 лет опыта\n"
            "Оклад: 250-320 т.р.\n"
            "Оформление: по СЗ или ИП (обсуждаемо)\n\n"
            "❗️Для проекта, требуется Senior разработчик (Python) с уклоном знаний ETL/ELT/DWH, "
            "которому предстоит заниматься развитием крупной информационной системы (подробности при общении). "
            "В дружественной команде с хорошо отлаженными бизнес процессами.\n\n"
            "Стек проекта: Python, Pandas, Apache Airflow, Арх. знания аналитических компонентов ETL/ELT/DWH, "
            "SQL, Gitlab, HTTP (REST, SOAP), JSON/XML/CSV, MQ (Kafka, Artemis), Kubernetes.\n"
            "Полная занятость на удаленке.\n\n"
            "❗️Что предстоит делать:\n"
            "Разработка крупной информационной системы под требованиям в формате аутстафф.\n\n"
            "❗️Ожидаем от кандидата:\n"
            "- Опыт работы не менее 4-х лет: Python, Pandas, Apache Airflow, Арх. знания аналитических компонентов ETL/ELT/DWH, "
            "SQL, Gitlab, HTTP (REST, SOAP), JSON/XML/CSV, MQ (Kafka, Artemis), Kubernetes\n"
            "- Опыт проработки архитектуры решения\n"
            "- Умение обосновать свой выбор\n"
            "Плюсом будет: Java: JDBC, Spring Integration, MapStruct\n\n"
            "❗️Если вакансия заинтересовала, пиши: @HRbestsoft"
        )
        msgs = [sn(id=1, text=vacancy_text_1), sn(id=2, text=vacancy_text_2)]

        vacancies = parser.msgs_to_vacancies(msgs)
        vacancy = vacancies[0]
        print(vacancies)

        assert vacancy.languages == ['Python']
        assert vacancy.salary == {'min': 200000, 'max': 240000}
        assert vacancy.work_mode == 'remote'
        assert len(vacancies) > 1

    def test_convert_small_vacancy(self):
        parser = DeepSeekVacanciesParser()
        msg = {'id': 1, 'text': 'Frontend-разработчик (React/TypeScript) Зп 200-250 тысяч'}
        msgs = [sn(**msg)]
        vacancies = parser.msgs_to_vacancies(msgs)

        vacancy = vacancies[0]
        assert vacancy.salary == {'min': 200000, 'max': 250000}
